app/Http/Controllers/PostCrudController.php

    public function destroy($id): RedirectResponse
    {
        $postDelete = Post::findOrFail($id);
        $postDelete->delete();
---
select * from `posts` where `posts`.`id` = '1' and `posts`.`deleted_at` is null limit 1
update `posts` set `deleted_at` = '2023-06-27 17:28:33', `posts`.`updated_at` = '2023-06-27 17:28:33' where `id` = 1

    public function indexTrashed()
    {
        $countTrashedOnly = Post::onlyTrashed()->count();
        $posts = Post::onlyTrashed()->get();
---
select count(*) as aggregate from `posts` where `posts`.`deleted_at` is not null
select * from `posts` where `posts`.`deleted_at` is not null

    public function trashedAll()
    {

        $countTrashed = Post::onlyTrashed()->count();

        if ($countTrashed == 0) {
            $messageCount = "No se restauro ningun registro";
        } else {
            $messageCount = $countTrashed .  ' Registro restaurado ';
        }
        Post::onlyTrashed()->restore();
---
select count(*) as aggregate from `posts` where `posts`.`deleted_at` is not null
update `posts` set `deleted_at` = '', `posts`.`updated_at` = '2023-06-27 17:28:36' where `posts`.`deleted_at` is not null